In [1]:
import pandas as pd

In [3]:
link=pd.read_csv("ml-25m/links.csv")

In [4]:
movie = pd.read_csv("ml-25m/movies.csv")
movie.columns

Index(['movieId', 'title', 'genres'], dtype='object')

In [5]:
link.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [6]:
movie=movie.loc[:,['movieId', 'title']]

In [7]:
movie.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [8]:
rating = pd.read_csv("ml-25m/ratings.csv")
rating.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [9]:
rating.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [10]:
rating.shape

(25000095, 4)

In [11]:
x=rating['userId'].value_counts()>500

In [12]:
y = x[x].index

In [13]:
y.shape

(9663,)

In [14]:
rating=rating[rating['userId'].isin(y)]

In [15]:
rating.shape

(8935061, 4)

In [16]:
movie_details=movie.merge(rating,on='movieId')

In [17]:
movie_details.head()

   movieId             title  userId  rating   timestamp
0        1  Toy Story (1995)       3     4.0  1439472215
1        1  Toy Story (1995)      12     4.0  1167582601
2        1  Toy Story (1995)     120     5.0   956264593
3        1  Toy Story (1995)     166     4.0   942014736
4        1  Toy Story (1995)     171     4.5  1074594380

In [18]:
movie_details1=movie_details.merge(link,on='movieId')

In [19]:
movie_details1.head()

   movieId             title  userId  rating   timestamp  imdbId  tmdbId
0        1  Toy Story (1995)       3     4.0  1439472215  114709   862.0
1        1  Toy Story (1995)      12     4.0  1167582601  114709   862.0
2        1  Toy Story (1995)     120     5.0   956264593  114709   862.0
3        1  Toy Story (1995)     166     4.0   942014736  114709   862.0
4        1  Toy Story (1995)     171     4.5  1074594380  114709   862.0

In [20]:
movie_details1.drop(labels=['timestamp'],inplace=True,axis=1)

In [21]:
movie_details1.head()

   movieId             title  userId  rating  imdbId  tmdbId
0        1  Toy Story (1995)       3     4.0  114709   862.0
1        1  Toy Story (1995)      12     4.0  114709   862.0
2        1  Toy Story (1995)     120     5.0  114709   862.0
3        1  Toy Story (1995)     166     4.0  114709   862.0
4        1  Toy Story (1995)     171     4.5  114709   862.0

In [23]:
movie_details.head()

   movieId             title  userId  rating   timestamp
0        1  Toy Story (1995)       3     4.0  1439472215
1        1  Toy Story (1995)      12     4.0  1167582601
2        1  Toy Story (1995)     120     5.0   956264593
3        1  Toy Story (1995)     166     4.0   942014736
4        1  Toy Story (1995)     171     4.5  1074594380

In [24]:
number_rating =movie_details.groupby('title')['rating'].count().reset_index()

In [25]:
number_rating.rename(columns={'rating':'number of rating'},inplace=True)

In [26]:
number_rating.head()

                                               title  number of rating
0  "BLOW THE NIGHT!" Let's Spend the Night Togeth...                 1
1                   "Great Performances" Cats (1998)                42
2                         #1 Cheerleader Camp (2010)                 7
3                                   #Captured (2017)                 2
4                            #Female Pleasure (2018)                 2

In [27]:
number_rating['number of rating'].describe()

count    57499.000000
mean       155.395068
std        609.185252
min          1.000000
25%          2.000000
50%          5.000000
75%         29.000000
max       9025.000000
Name: number of rating, dtype: float64

In [28]:
movie_details2=movie_details1.merge(number_rating,on='title')

In [37]:
movie_details2.head()

   movieId             title  userId  rating  imdbId  number of rating
0        1  Toy Story (1995)       3     4.0  114709              8078
1        1  Toy Story (1995)      12     4.0  114709              8078
2        1  Toy Story (1995)     120     5.0  114709              8078
3        1  Toy Story (1995)     166     4.0  114709              8078
4        1  Toy Story (1995)     171     4.5  114709              8078

In [34]:
movie_details2=movie_details2[movie_details2['number of rating']>=50]

In [35]:
movie_details2.shape

(8596657, 7)

In [ ]:
movie_details2.to_csv("cleaned.csv",index=False)